app/Http/Controllers/NewsController.php

    public function index(Request $request)
    {
        $cond_title = $request->cond_title;
        // $cond_title が空白でない場合は、記事を検索して取得する
        if ($cond_title != '') {
            $posts = News::where('title', $cond_title).orderBy('updated_at', 'desc')->get();
        } else {
            $posts = News::all()->sortByDesc('updated_at');
---
select * from `news`

    public function profile(Request $request)
    {
        $profile = Profile::find($request->id);


        $profiles = Profile::all();
---
select * from `profiles`