app/Http/Controllers/Admin/NewsController.php

select * from `news`
---
  public function index(Request $request)
  {
      $cond_title = $request->cond_title;
      if ($cond_title != '') {
        //検索されたら検索結果を取得する
          $posts = News::where('title', $cond_title)->get();
      } else {
          $posts = News::all();

update `news` set `title` = 'テスト', `body` = 'テスト', `image_path` = '', `updated_at` = '2019-01-29 08:27:03' where `id` = 10
insert into `histories` (`news_id`, `edited_at`, `updated_at`, `created_at`) values (10, '2019-01-29 08:27:03', '2019-01-29 08:27:03', '2019-01-29 08:27:03')
---
  public function update(Request $request)
  {
      // Validationをかける
      $this->validate($request, News::$rules);
      // News Modelからデータを取得する
      $news = News::find($request->id);
      $news_form = $request->all();
      // 送信されてきたフォームデータを格納する
      if (isset($news_form['image'])) {
        $path = $request->file('image')->store('public/image');
        $news->image_path = basename($path);
      } else {
          $news->image_path = null;
      }


      unset($news_form['_token']);
      unset($news_form['_image']);
      unset($news_form['_remove']);
      // 該当するデータを上書きして保存する
      $news->fill($news_form)->save();

      //18章編集履歴
      $history = new History;
      $history->news_id = $news->id;
      $history->edited_at = Carbon::now();
      $history->save();

delete from `news` where `id` = 4
---
  public function delete(Request $request)
  {
      // 該当するNews Modelを取得
      $news = News::find($request->id);
      // 削除する
      $news->delete();