app/Http/Controllers/Admin/ProfileController.php

  public function update(Request $request)
  {
    $this->validate($request, Profile::$rules);
    // News Modelからデータを取得する
    $profiles = Profile::find($request->id);
    // 送信されてきたフォームデータを格納する
    $profiles_form = $request->all();

    unset($profiles_form['_token']);
    unset($profiles_form['_remove']);
    // 該当するデータを上書きして保存する
    $profiles->fill($profiles_form)->save();

    //18章編集履歴
    $history = new Profilehistory;
    $history->profile_id = $profiles->id;
    $history->edited_at = Carbon::now();
    $history->save();
---
update `profiles` set `name` = '寺部　裕介', `hobby` = '食べることが好きです。', `introduction` = '現在はPHP/Laravelの勉強中です。', `updated_at` = '2019-01-29 07:56:45' where `id` = 1
insert into `profilehistories` (`profile_id`, `edited_at`, `updated_at`, `created_at`) values (1, '2019-01-26 04:56:02', '2019-01-26 04:56:02', '2019-01-26 04:56:02')

  public function create(Request $request)
  {

      // // Varidationを行う
      $this->validate($request, Profile::$rules);

      $profile = new Profile;
      $profile_form = $request->all();



      unset($profile_form['_token']);
      // データベースに保存する
      $profile->fill($profile_form);
      $profile->save();
---
insert into `profiles` (`name`, `gender`, `hobby`, `introduction`, `updated_at`, `created_at`) values ('寺部', '男', 'gxfcvhjklッ；', 'gfxhjkッ；', '2019-01-26 04:55:47', '2019-01-26 04:55:47')

    public function add()
    {
        $profiles = Profile::all();
---
select * from `profiles`

    public function delete(Request $request)
    {
        // 該当するNews Modelを取得
        $profile = Profile::find($request->id);
        // 削除する
        $profile->delete();
---
delete from `profiles` where `id` = 8